
def adbWait():
	print("*****************************")
	print("***   等待ADB连接中...    ***")
	print("*****************************")

def homeHead():
	print("*************************************************************************************************")
	print("**  _   _   _   _   _____       ___        _____   _____   _____        _       _____   _____  **")
	print("** | | | | | | | | |  _  \     /   |      /  ___| | ____| |_   _|      | |     /  _  \ /  ___| **")
	print("** | |_| | | | | | | |_| |    / /| |      | |     | |__     | |        | |     | | | | | |     **")
	print("** |  _  | | | | | |  _  {   / / | |      | |  _  |  __|    | |        | |     | | | | | |  _  **")
	print("** | | | | | |_| | | |_| |  / /  | |      | |_| | | |___    | |        | |___  | |_| | | |_| | **")
	print("** |_| |_| \_____/ |_____/ /_/   |_|      \_____/ |_____|   |_|        |_____| \_____/ \_____/ **")
	print("**                                                                                             **")
	print("**                                                                                    __    __ **")
	print("**                                                                                    __)  |  |**")
	print("** 2.0.6wl                                                           by FrankPian    (___ .|__|**")
	print("*************************************************************************************************")

def homeError():
	print("*****************************")
	print("*****  输入号码有误!    *****")
	print("*****************************")

def nologError():
	print("*****************************")
	print("******* 没有飞控日志! *******")
	print("*****************************")

def homeMenu():
	print("[1] 进入 /data/log路径")
	print("[2] 获取gps日志")
	print("[3] 清空所有日志 (包含GPS日志)")
	print("[4] 打开GPS日志记录开关")
	print("[5] 修正本地GPS日志文件名")
	print("[6] 退出")

def home_1Menu():
	print("[1] 下载所有日志          [2] 下载所有仅飞控日志")
	print("[3] 下载指定SN码所有日志  [4] 下载指定SN码仅飞控日志")
	print("[5] 删除该路径下所有日志  [6] 返回")

def home_5Warning():
	print("正在修改文件名中...")

def home_5Sucess():
	print("修改文件名成功！")
